background/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(

    //(-1.5 -3 -1)
    //( 2 -3 -1)
    //( 2  1 -1)
    //(-1.5  1 -1)
    //(-1.5 -3  1)
    //( 2 -3  1)
    //( 2  1  1)
    //(-1.5  1  1)


    (-8.0 -10.0 -10)
    ( 12. -10.0 -10)
    ( 12.  10.0 -10)
    (-8.0  10.0 -10)
    (-8.0 -10.0  10)
    ( 12. -10.0  10)
    ( 12.  10.0  10)
    (-8.0  10.0  10)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 200 200) simpleGrading (1 1 1)
);

edges
(
);

boundary
(   
    // oversetPatch
    // {
    //     type overset;
    //     faces ();
    // }

    stationaryWalls
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    // front
    // {
    //     type wall;
    //     faces
    //     (
    //         (4 5 6 7)
    //     );
    // }

    // back
    // {
    //     type wall;
    //     faces
    //     (
    //         (0 3 2 1)
    //     );
    // }
);

mergePatchPairs
(
);

// ************************************************************************* //
