background/0_org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.375;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    overset
    {
        type            overset;
	value		$internalField;
    }

    inlet
    {
        type        turbulentIntensityKineticEnergyInlet;
        intensity   0.05;
        value       $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    stationaryWalls
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    wing
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    "(wing|topAndBottom)"
    {
        type            kqRWallFunction;
        value           $internalField;    
    }

}

// ************************************************************************* //
