background/0_org/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    oversetPatch
    {
        patchType       overset;
        type            zeroGradient;
    }
    overset
    {
        patchType       overset;
        type            zeroGradient;
    }
    ".*"
    {
        type           uniformFixedValue;
        uniformValue            (0 0 0);
    }

    stationaryWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    wing
    {
        type            calculated;
    }


}

// dimensions [0 1 0 0 0 0 0];

// internalField uniform (0 0 0);

// boundaryField
// {
//     overset
//     {
//        type            uniformFixedValue;
//         uniformValue    (0 0 0);
//     }

//     wing
//     {
//         type sixDoFRigidBodyMotion;
        //    mass            0.0277;
        //    centreOfMass    (-0.004956 -0.00351 0.008337);
        //    momentOfInertia (0.013364978 0.098424885 0.085904587);
        //    angularMomentum (0.735 5.413 4.725);
        //    g               (0 -9.81 0);
        //    rho         rhoInf;
        //    rhoInf          1;
        //    report          on;
        //    omega           55.0;       //units of rad/s
//         report on;
//         constraints
//         {
//             maxIterations 500;
//             zAxis
//             {
//                 sixDoFRigidBodyMotionConstraint fixedAxis;
//                 tolerance 1e-06;
//                 relaxationFactor 0.07;
//                 fixedAxisCoeffs
//                 {
//                     axis ( 0 1 0 );
//                 }
//             }
//         }
//         value uniform (0 0 0);
//     }
//     "(inlet|outlet|topAndBottom)"
//     {
//         type fixedValue;
//         value uniform (0 0 0);
//     }
// }
// ************************************************************************* //
