background/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler; 
}

gradSchemes
{

    default 	     Gauss linear;

}

divSchemes
{
    default         none;

    div(phi,U)      	Gauss upwind;
    div(phi,omega) 		Gauss upwind;
    div(phi,epsilon) 	Gauss upwind;
    div(phi,k) 			Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 0.5;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 0.5;
}

oversetInterpolation
{
    method          inverseDistance;
}


wallDist
{
    method meshWave;

    // Optional entry enabling the calculation
    // of the normal-to-wall field
    nRequired false;
}


/*oversetInterpolationRequired
{
k;
omega;
epsilon;
nut;
}*/
/*laplacianSchemes
{
    laplacian(yPsi) <laplacian scheme>;
}*/
/*
fluxRequired
{
    default         no;
    pcorr           ;
    p               ;
}
*/

// ************************************************************************* //
