background/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

//#include "../0/include/initialConditions"

forceCoeffs1
    {

	type 			forceCoeffs;
	libs 			(forces);
	//patches ("body1" "body2" "body3");
	patches 		(wing);

	pName 			p;
	Uname 			U;
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1;  

	log true;

	CofR 			(-0.004956 -0.00351 0.008337);
	liftDir 		(0 1 0);
	dragDir 		(1 0 0);
	pitchAxis 		(0 0 1);
	magUInf 		2.5;
	lRef 			1.0;
	Aref 			1.0;

        writeControl   timeStep;
        writeInterval  10;
    }

// ************************************************************************* //
