background/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

forces
    {
	type forces;
	libs (forces);

	//writeControl outputTime;
	writeControl   timeStep;
	writeInterval  100;

	//// Patches to sample
	//patches ("body1" "body2" "body3");
	patches ("wing");

	//// Name of fields
	pName p;
	Uname U;

	//// Density
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1;  

	//// Centre of rotation
	CofR (-0.004956 -0.00351 0.008337);
    }



// ************************************************************************* //
